<?php

declare(strict_types=1);

return [

    'last_activity' => [
        'curr' => 'Сейчас на сайте',
        'prev' => 'В сети: :time',
    ],

    'gender' => [
        'male' => 'Мужской',
        'female' => 'Женский',
        'other' => 'Не выбрано',
    ],

    'theme' => [
        'light' => 'Светлая',
        'dark' => 'Тёмная',
    ],

    'birthday' => [
        'year' => 'год|года|лет',
    ],

    'joined' => [
        'title' => 'Участник',
        'label' => 'на сайте с :date г.',
        'month' => [
            'Jan' => 'января',
            'Feb' => 'февраля',
            'Mar' => 'марта',
            'Apr' => 'апреля',
            'May' => 'мая',
            'Jun' => 'июня',
            'Jul' => 'июля',
            'Aug' => 'августа',
            'Sep' => 'сентября',
            'Oct' => 'октября',
            'Nov' => 'ноября',
            'Dec' => 'декабря',
        ],

        'time_unit' => [
            'year' => 'год|года|лет',
            'month' => 'месяц|месяца|месяцев',
            'day' => 'день|дня|дней',
            'hour' => 'час|часа|часов',
            'minute' => 'минута|минуты|минут',
        ],
    ],

];
